; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v6 - type_1 ?v5 - type_3)
 	      (pred_2 ?v1 - object ?v5 - type_3)
	      (pred_1 ?v6 - type_1 ?v2 - type_2)
	      (pred_3 ?v6 - type_1 ?v1 - object ?v2 - type_2))

   (:action op_3
       :parameters  (?v6 - type_1 ?v7 ?v3 - type_3)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v3)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_1 ?v4 - object ?v8 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v8) (pred_4 ?v6 ?v8) (pred_1 ?v6 ?v2))
       :effect (and (pred_3 ?v6 ?v4 ?v2)
		    (not (pred_2 ?v4 ?v8)) 
		    (not (pred_1 ?v6 ?v2))))

   (:action op_1
       :parameters (?v6 - type_1 ?v4 - object ?v8 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v4 ?v2) (pred_4 ?v6 ?v8))
       :effect (and (pred_2 ?v4 ?v8)
		    (pred_1 ?v6 ?v2)
		    (not (pred_3 ?v6 ?v4 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_09 obj_01 - type_1
obj_05 obj_07 obj_02 obj_10 - type_2
obj_08 obj_12 obj_11 - type_3
obj_06 obj_03 obj_04 - object)
(:init
(pred_4 obj_09 obj_12)
(pred_1 obj_09 obj_05)
(pred_1 obj_09 obj_07)
(pred_4 obj_01 obj_12)
(pred_1 obj_01 obj_02)
(pred_1 obj_01 obj_10)
(pred_2 obj_06 obj_08)
(pred_2 obj_03 obj_11)
(pred_2 obj_04 obj_11)
)
(:goal
(and
(pred_2 obj_06 obj_08)
(pred_2 obj_03 obj_11)
(pred_2 obj_04 obj_08)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_11)))
)
)

; plan
1. (op_3 obj_09 obj_12 obj_08)
   deleted: (pred_4 obj_09 obj_12)
   added: (pred_4 obj_09 obj_08)
   goals met: 2 of 3
2. (op_3 obj_01 obj_12 obj_11)
   deleted: (pred_4 obj_01 obj_12)
   added: (pred_4 obj_01 obj_11)
   goals met: 2 of 3
3. (op_2 obj_01 obj_04 obj_11 obj_10)
   deleted: (pred_2 obj_04 obj_11) (pred_1 obj_01 obj_10)
   added: (pred_3 obj_01 obj_04 obj_10)
   goals met: 2 of 3
4. (op_3 obj_01 obj_11 obj_08)
   deleted: (pred_4 obj_01 obj_11)
   added: (pred_4 obj_01 obj_08)
   goals met: 2 of 3
5. (op_1 obj_01 obj_04 obj_08 obj_10)
   deleted: (pred_3 obj_01 obj_04 obj_10)
   added: (pred_2 obj_04 obj_08) (pred_1 obj_01 obj_10)
   goals met: 3 of 3
